app/controllers/articles_controller.rb

	def index
		@articles = Article.limit(5)
---
SELECT  "articles".* FROM "articles" LIMIT $1  [["LIMIT", 5]]